bitcoin-transactions.org
#+TITLE: How Bitcoin Transactions Work

This guide aims to serve as a concise entry point for a technical dive
into bitcoin. It is not trying to be a complete overview on its own;
see below for sources. As with any software, the ultimate source of
truth for technical details is the source code.

Transactions are a great place to start when trying to understand
bitcoin. Each block in the bitcoin ledger is fundamentally a list of
transactions[fn:1], and understanding transactions is prerequisite to
understanding bitcoin "addresses".

* Transactions
From a high level, a single bitcoin transaction consists of a list of
inputs and a list of outputs[fn:2].

Each output contains, crucially, two things:
- An amount. We call the unit for this amount the "satoshi"; we call
  100 million satoshis a bitcoin.
- A "locking script", also widely referred to as ~scriptPubKey~ (a
  name which comes from the bitcoin source[fn:3]). This script
  imposes rules on how this output can be spent by a future
  transaction.

Each input contains, similarly, two things:
- An hash of an existing transaction, and an index referring to one of
  its unused outputs. Once used, the unspent transaction output
  (widely referred to as "UTXO") cannot be used again. (The reason for
  this is that it makes the structure of the ledger very simple: an
  "account" on this ledger doesn't carry a balance, but instead is
  static until closed)
- A "unlocking script" (also widely called ~scriptSig~). Part of
  verifying a transaction is concatenating the unlocking script of an
  input with the locking script of the referenced output and
  evaluating the result using bitcoin script[fn:4].

An implication of this structure is that there can be different types
of "addresses", corresponding to different types of locking scripts,
and that those "addresses" are interoperable: when a UTXO locked using
one type of script is spent, the spender can choose any type of script
to lock it again[fn:5].

The locking and unlocking scripts are written in a Turing-incomplete
DSL referred to as "bitcoin script". Technically any arbitrary script
can be provided as a locking script[fn:6], but the reference bitcoin
client only accepts 5 "standard" transaction script
patterns[fn:7]. The expected way to lock transaction output is to
require a signature from the recipient, and so there are [[https://en.bitcoin.it/wiki/Script#Opcodes][opcodes]] builtin
to bitcoin script that support signing and verifying signatures using
a specific public-key cryptosystem (ECDSA with ~secp256k1~--see
below). But, AFAIK, you could implement any public key signature
system as a (very long) bitcoin script.

* Signatures
Bitcoin needs a mechanism for signing a transactions so that only the
intended recipient has the ability to spend a specific output of a
specific transaction. For this it uses the elliptic curve digital
signature algorithm (ECDSA). The ECDSA is a variant of the
NIST-standardized DSA algorithm and can be used with an elliptic curve
of any parameters. For its elliptic curve, bitcoin uses [[https://www.secg.org/sec2-v2.pdf][~secp256k1~]]
which is a specific elliptic curve published by the Standards for
Efficient Cryptography Group (SECG).

** How does ECDSA work?
The digital signature algorithm uses a public key to serve as a public
identity, and a corresponding private key to sign a message.

The first step in generating a key pair is generating a private
key. For the ECDSA that bitcoin uses, the valid values of this key are
from ~0x1~ to ~0xFFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFF BAAE DCE6
AF48 A03B BFD2 5E8C D036 4140~[fn:8]. This number is less than
$2^{256}$, but so very slightly that we might as well call them
equivalent. In fact, these two numbers differ by more than the number
of grains of sand on ten quadrillion Earths[fn:9], but $2^{256}$ is so
large that this difference is hard to notice.

Once the private key is chosen, the public key is determined as
$K = k * G$ where:
- $K$ is the public key
- $k$ is the private key
- $G$ is the generator point, specified by ~secp256k1~
- $*$ is elliptic curve multiplication

For further details on ECDSA, including signature computation, try:
https://cryptobook.nakov.com/digital-signatures/ecdsa-sign-verify-messages

** Why ECDSA?
Cryptographic signing generally (but [[https://crypto.stackexchange.com/questions/14654/digital-signature-using-symmetric-key-cryptography][not always]]) requires an
asymmetric cryptosystem. Other asymmetric cryptosystems exist: RSA
(which is slower) and Diffie-Hellman (which is [[https://en.wikipedia.org/wiki/Diffie–Hellman_key_exchange#Public_key][not usually used for
signatures]]) and even vanilla DSA (which would require storing larger
keys for the same level of security, resulting in a bigger
ledger).

** Why ~secp256k1~?
For reasons discussed [[https://dappworks.com/why-did-satoshi-decide-to-use-secp256k1-instead-of-secp256r1/][here]].

* Locking Patterns
A bitcoin "address" is a piece of information that you can give to
someone else to put in their transcation output locking script; this
information is different based on which locking pattern you
choose. The term "address" can be misleading because a bitcoin
"address" is intended to be a single-use invoice (to use the
terminology of the bitcoin wiki[fn:10]) rather than a persistent,
pseudonymous address.

Because there are different types of locking scripts, your payer needs
to know what kind of information you're giving them to construct the
correct kind of locking script. For this reason, there are standard
prefixes[fn:11] corresponding to different locking patterns. These
prefixes are only used by the piece of software you use to make
transactions (the "wallet") and don't actually appear in the
blockchain[fn:12].

An implication of the locking mechanism is that destroying bitcoins is
straightforward:
- https://en.bitcoin.it/wiki/Controlled_supply
- https://bitcoin.stackexchange.com/questions/1851/how-to-generate-a-valid-bitcoin-address-for-destroying-bitcoins/1852

For each of the following five standard locking patterns, the
following source is great for more detail:

https://learnmeabitcoin.com/technical/scriptPubKey

