bitcoin-transactions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 00:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How Bitcoin Transactions Work</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">How Bitcoin Transactions Work</h1>
<p>
This guide aims to serve as a concise entry point for a technical dive
into bitcoin. It is not trying to be a complete overview on its own;
see below for sources. As with any software, the ultimate source of
truth for technical details is the source code.
</p>

<p>
Transactions are a great place to start when trying to understand
bitcoin. Each block in the bitcoin ledger is fundamentally a list of
transactions<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, and understanding transactions is prerequisite to
understanding bitcoin "addresses".
</p>

<div id="outline-container-org698c8e0" class="outline-2">
<h2 id="org698c8e0">Transactions</h2>
<div class="outline-text-2" id="text-org698c8e0">
<p>
From a high level, a single bitcoin transaction consists of a list of
inputs and a list of outputs<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<p>
Each output contains, crucially, two things:
</p>
<ul class="org-ul">
<li>An amount. We call the unit for this amount the "satoshi"; we call
100 million satoshis a bitcoin.</li>
<li>A "locking script", also widely referred to as <kbd>scriptPubKey</kbd> (a
name which comes from the bitcoin source<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>). This script
imposes rules on how this output can be spent by a future
transaction.</li>
</ul>

<p>
Each input contains, similarly, two things:
</p>
<ul class="org-ul">
<li>An hash of an existing transaction, and an index referring to one of
its unused outputs. Once used, the unspent transaction output
(widely referred to as "UTXO") cannot be used again. (The reason for
this is that it makes the structure of the ledger very simple: an
"account" on this ledger doesn't carry a balance, but instead is
static until closed)</li>
<li>A "unlocking script" (also widely called <kbd>scriptSig</kbd>). Part of
verifying a transaction is concatenating the unlocking script of an
input with the locking script of the referenced output and
evaluating the result using bitcoin script<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>.</li>
</ul>

<p>
An implication of this structure is that there can be different types
of "addresses", corresponding to different types of locking scripts,
and that those "addresses" are interoperable: when a UTXO locked using
one type of script is spent, the spender can choose any type of script
to lock it again<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>.
</p>

<p>
The locking and unlocking scripts are written in a Turing-incomplete
DSL referred to as "bitcoin script". Technically any arbitrary script
can be provided as a locking script<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>, but the reference bitcoin
client only accepts 5 "standard" transaction script
patterns<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>. The expected way to lock transaction output is to
require a signature from the recipient, and so there are <a href="https://en.bitcoin.it/wiki/Script#Opcodes">opcodes</a> builtin
to bitcoin script that support signing and verifying signatures using
a specific public-key cryptosystem (ECDSA with <kbd>secp256k1</kbd>&#x2013;see
below). But, AFAIK, you could implement any public key signature
system as a (very long) bitcoin script.
</p>
</div>
</div>

<div id="outline-container-org2dccb5a" class="outline-2">
<h2 id="org2dccb5a">Signatures</h2>
<div class="outline-text-2" id="text-org2dccb5a">
<p>
Bitcoin needs a mechanism for signing a transactions so that only the
intended recipient has the ability to spend a specific output of a
specific transaction. For this it uses the elliptic curve digital
signature algorithm (ECDSA). The ECDSA is a variant of the
NIST-standardized DSA algorithm and can be used with an elliptic curve
of any parameters. For its elliptic curve, bitcoin uses <a href="https://www.secg.org/sec2-v2.pdf"><kbd>secp256k1</kbd></a>
which is a specific elliptic curve published by the Standards for
Efficient Cryptography Group (SECG).
</p>
</div>

<div id="outline-container-org5174350" class="outline-3">
<h3 id="org5174350">How does ECDSA work?</h3>
<div class="outline-text-3" id="text-org5174350">
<p>
The digital signature algorithm uses a public key to serve as a public
identity, and a corresponding private key to sign a message.
</p>

<p>
The first step in generating a key pair is generating a private
key. For the ECDSA that bitcoin uses, the valid values of this key are
from <kbd>0x1</kbd> to <kbd>0xFFFF FFFF FFFF FFFF FFFF FFFF FFFF FFFF BAAE DCE6
AF48 A03B BFD2 5E8C D036 4140</kbd><sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>. This number is less than
\(2^{256}\), but so very slightly that we might as well call them
equivalent. In fact, these two numbers differ by more than the number
of grains of sand on ten quadrillion Earths<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>, but \(2^{256}\) is so
large that this difference is hard to notice.
</p>

<p>
Once the private key is chosen, the public key is determined as
\(K = k * G\) where:
</p>
<ul class="org-ul">
<li>\(K\) is the public key</li>
<li>\(k\) is the private key</li>
<li>\(G\) is the generator point, specified by <kbd>secp256k1</kbd></li>
<li>\(*\) is elliptic curve multiplication</li>
</ul>

<p>
For further details on ECDSA, including signature computation, try:
<a href="https://cryptobook.nakov.com/digital-signatures/ecdsa-sign-verify-messages">https://cryptobook.nakov.com/digital-signatures/ecdsa-sign-verify-messages</a>
</p>
</div>
</div>

<div id="outline-container-org0462d96" class="outline-3">
<h3 id="org0462d96">Why ECDSA?</h3>
<div class="outline-text-3" id="text-org0462d96">
<p>
Cryptographic signing generally (but <a href="https://crypto.stackexchange.com/questions/14654/digital-signature-using-symmetric-key-cryptography">not always</a>) requires an
asymmetric cryptosystem. Other asymmetric cryptosystems exist: RSA
(which is slower) and Diffie-Hellman (which is <a href="https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange#Public_key">not usually used for
signatures</a>) and even vanilla DSA (which would require storing larger
keys for the same level of security, resulting in a bigger
ledger).
</p>
</div>
</div>

<div id="outline-container-org0992d46" class="outline-3">
<h3 id="org0992d46">Why <kbd>secp256k1</kbd>?</h3>
<div class="outline-text-3" id="text-org0992d46">
<p>
For reasons discussed <a href="https://dappworks.com/why-did-satoshi-decide-to-use-secp256k1-instead-of-secp256r1/">here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgef57243" class="outline-2">
<h2 id="orgef57243">Locking Patterns</h2>
<div class="outline-text-2" id="text-orgef57243">
<p>
A bitcoin "address" is a piece of information that you can give to
someone else to put in their transcation output locking script; this
information is different based on which locking pattern you
choose. The term "address" can be misleading because a bitcoin
"address" is intended to be a single-use invoice (to use the
terminology of the bitcoin wiki<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>) rather than a persistent,
pseudonymous address.
</p>

<p>
Because there are different types of locking scripts, your payer needs
to know what kind of information you're giving them to construct the
correct kind of locking script. For this reason, there are standard
prefixes<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup> corresponding to different locking patterns. These
prefixes are only used by the piece of software you use to make
transactions (the "wallet") and don't actually appear in the
blockchain<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>.
</p>

<p>
An implication of the locking mechanism is that destroying bitcoins is
straightforward:
</p>
<ul class="org-ul">
<li><a href="https://en.bitcoin.it/wiki/Controlled_supply">https://en.bitcoin.it/wiki/Controlled_supply</a></li>
<li><a href="https://bitcoin.stackexchange.com/questions/1851/how-to-generate-a-valid-bitcoin-address-for-destroying-bitcoins/1852">https://bitcoin.stackexchange.com/questions/1851/how-to-generate-a-valid-bitcoin-address-for-destroying-bitcoins/1852</a></li>
</ul>

<p>
For each of the following five standard locking patterns, the
following source is great for more detail:
</p>

<p>
<a href="https://learnmeabitcoin.com/technical/scriptPubKey">https://learnmeabitcoin.com/technical/scriptPubKey</a>
</p>
</div>
