bitcoin-transactions.org
** Pay to Public Key ("P2PK")
Overview: the unlocking script verifies that the spender's signature
matches the public key provided by the payer.

There are problems with this pattern:
1. Public keys are long (65 bytes)[fn:13] and therefore hard to share
2. The payee must reveal their public key before spending, which poses
   theoretical security risks[fn:14] (such as that posed by a
   hypothetical version of Shor's algorithm modified to solve the
   discrete log problem on elliptic curves); but, in a quantum
   context, bitcoin would have bigger problems[fn:15]

This pattern is not in modern use.

** Pay to Public Key Hash ("P2PKH")
Overview: the locking script verifies that the spender's (ECDSA) public
key maps to a hash specified by the payer, and that the spender can
provide a signature to match their public key.

Specifically, the locking script computes a ~RIPEMD160(SHA256())~ hash
of the public key. ~RIPEMD160(SHA256())~ maps a 256-bit public key to
a 160-bit hash. There are at most $2^{160}$ P2PKH addresses (it's
"suspected", but not certain[fn:16], that RIPEMD160 actually reaches
all 2^{160} values) and there are almost $2^{256}$ private keys;
therefore, there are on average about $2^{96}$ private keys that collide
to each of the about $2^{160}$ P2PKH addresses.

P2PKH addresses are shared by encoding the hash using Base58Check
which makes the address:
- shorter, because a public key hash is used instead of a full public
  key
- more readable, because Base58Check excludes ambiguous characters
- less error-proton, because Base58Check incorporates a checksuum

It is the job of the wallet[fn:17] to strip the prefix and checksum
from an entered P2PKH address so that the raw public key hash can be
used in the locking script and correctly checked for equality.

There are a couple of good sources that breakdown a real P2PKH
transaction:
- https://bitcoin.stackexchange.com/questions/57644/what-are-the-parts-of-a-bitcoin-transaction-input-script
- https://medium.com/coinmonks/bitcoin-p2pkh-transaction-breakdown-bb663034d6df

Many say that if compressed public keys had been known to the
architect of bitcoin, P2PKH would not have been necessary[fn:18]
(because ~RIPEMD160(SHA256())~ mainly serves to shorten the key, not
to add security). Still, the Base58Check encoding is valuable.

** Multisig ("P2MS", BIP 11)
Overview: the unlocking script verifies that enough signatures
matching the public keys provided by the payer are given by the
spender. Perhaps a better name for this type of transaction would be
P2PKs.

** Pay to Script Hash ("P2SH", BIP 16)
Overview: the locking script verifies that the spender's unlocking script
maps to the hash specified by the payer; then the unlocking script is
deserialized (reinterpreted not as a value to be hashed but as a
sequence of opcodes to be executed) and executed (using arguments
provided by the spender) to confirm validity. Since this transaction
type involves more than just concatenating the unlocking and locking
scripts and then executing (it needs to execute the unlocking script
too), it required an amendment to bitcoin: [[https://github.com/bitcoin/bips/blob/master/bip-0016.mediawiki#Backwards_Compatibility][BIP 16]].

Note that providing and using those inputs is necessary to achieve
security. Imagine a script the pushes a magic number on the stack,
duplicates it, and checks for equality. This script doesn't use inputs
and always succeeds. If you use the hash of this script to receive
funds, then as soon as you broadcast a transaction that spends your
coins, anyone watching could use your script to broadcast a different
transaction spending the output in a different way.

It is cheaper to use P2SH to implement multisig than it is to use the
P2MS pattern.

** Data Output
Overview: the locking script just stores data.

Example transaction:
[[https://blockchair.com/bitcoin/transaction/52dd20f60d6e14e5a783e7668cf410efdea40cd9a92479b0f2423d0bc63575fa][~52dd20f60d6e14e5a783e7668cf410efdea40cd9a92479b0f2423d0bc63575fa~]]

* "Segregated Witness"
"Segregated witness" or "segwit" refers to the segregation of witness
data (the ~scriptSig~ of each transaction input) from the transaction
itself. In 2015, [[https://github.com/bitcoin/bips/blob/master/bip-0141.mediawiki][BIP141]] proposed this change and [[https://github.com/bitcoin/bips/blob/master/bip-0173.mediawiki][BIP173]] proposed a new
address type for native segregates witness output. People refer to
P2PKH and P2SH segwit transactions as P2WPKH and P2WSH repectively,
but the logic of the locking is the same[fn:19]
- https://learnmeabitcoin.com/faq/segregated-witness
- https://bitcoin.stackexchange.com/questions/75047/bitcoin-technical-difference-between-p2pkh-and-p2sh-address-generation

