bitcoin-transactions.html

<div id="outline-container-orgfa48d6f" class="outline-3">
<h3 id="orgfa48d6f">Pay to Public Key ("P2PK")</h3>
<div class="outline-text-3" id="text-orgfa48d6f">
<p>
Overview: the unlocking script verifies that the spender's signature
matches the public key provided by the payer.
</p>

<p>
There are problems with this pattern:
</p>
<ol class="org-ol">
<li>Public keys are long (65 bytes)<sup><a id="fnr.13" class="footref" href="#fn.13" role="doc-backlink">13</a></sup> and therefore hard to share</li>
<li>The payee must reveal their public key before spending, which poses
theoretical security risks<sup><a id="fnr.14" class="footref" href="#fn.14" role="doc-backlink">14</a></sup> (such as that posed by a
hypothetical version of Shor's algorithm modified to solve the
discrete log problem on elliptic curves); but, in a quantum
context, bitcoin would have bigger problems<sup><a id="fnr.15" class="footref" href="#fn.15" role="doc-backlink">15</a></sup></li>
</ol>

<p>
This pattern is not in modern use.
</p>
</div>
</div>

<div id="outline-container-org68412a0" class="outline-3">
<h3 id="org68412a0">Pay to Public Key Hash ("P2PKH")</h3>
<div class="outline-text-3" id="text-org68412a0">
<p>
Overview: the locking script verifies that the spender's (ECDSA) public
key maps to a hash specified by the payer, and that the spender can
provide a signature to match their public key.
</p>

<p>
Specifically, the locking script computes a <kbd>RIPEMD160(SHA256())</kbd> hash
of the public key. <kbd>RIPEMD160(SHA256())</kbd> maps a 256-bit public key to
a 160-bit hash. There are at most \(2^{160}\) P2PKH addresses (it's
"suspected", but not certain<sup><a id="fnr.16" class="footref" href="#fn.16" role="doc-backlink">16</a></sup>, that RIPEMD160 actually reaches
all 2<sup>160</sup> values) and there are almost \(2^{256}\) private keys;
therefore, there are on average about \(2^{96}\) private keys that collide
to each of the about \(2^{160}\) P2PKH addresses.
</p>

<p>
P2PKH addresses are shared by encoding the hash using Base58Check
which makes the address:
</p>
<ul class="org-ul">
<li>shorter, because a public key hash is used instead of a full public
key</li>
<li>more readable, because Base58Check excludes ambiguous characters</li>
<li>less error-proton, because Base58Check incorporates a checksuum</li>
</ul>

<p>
It is the job of the wallet<sup><a id="fnr.17" class="footref" href="#fn.17" role="doc-backlink">17</a></sup> to strip the prefix and checksum
from an entered P2PKH address so that the raw public key hash can be
used in the locking script and correctly checked for equality.
</p>

<p>
There are a couple of good sources that breakdown a real P2PKH
transaction:
</p>
<ul class="org-ul">
<li><a href="https://bitcoin.stackexchange.com/questions/57644/what-are-the-parts-of-a-bitcoin-transaction-input-script">https://bitcoin.stackexchange.com/questions/57644/what-are-the-parts-of-a-bitcoin-transaction-input-script</a></li>
<li><a href="https://medium.com/coinmonks/bitcoin-p2pkh-transaction-breakdown-bb663034d6df">https://medium.com/coinmonks/bitcoin-p2pkh-transaction-breakdown-bb663034d6df</a></li>
</ul>

<p>
Many say that if compressed public keys had been known to the
architect of bitcoin, P2PKH would not have been necessary<sup><a id="fnr.18" class="footref" href="#fn.18" role="doc-backlink">18</a></sup>
(because <kbd>RIPEMD160(SHA256())</kbd> mainly serves to shorten the key, not
to add security). Still, the Base58Check encoding is valuable.
</p>
</div>
</div>

<div id="outline-container-orgc44b8fe" class="outline-3">
<h3 id="orgc44b8fe">Multisig ("P2MS", BIP 11)</h3>
<div class="outline-text-3" id="text-orgc44b8fe">
<p>
Overview: the unlocking script verifies that enough signatures
matching the public keys provided by the payer are given by the
spender. Perhaps a better name for this type of transaction would be
P2PKs.
</p>
</div>
</div>

<div id="outline-container-org4d2c8c9" class="outline-3">
<h3 id="org4d2c8c9">Pay to Script Hash ("P2SH", BIP 16)</h3>
<div class="outline-text-3" id="text-org4d2c8c9">
<p>
Overview: the locking script verifies that the spender's unlocking script
maps to the hash specified by the payer; then the unlocking script is
deserialized (reinterpreted not as a value to be hashed but as a
sequence of opcodes to be executed) and executed (using arguments
provided by the spender) to confirm validity. Since this transaction
type involves more than just concatenating the unlocking and locking
scripts and then executing (it needs to execute the unlocking script
too), it required an amendment to bitcoin: <a href="https://github.com/bitcoin/bips/blob/master/bip-0016.mediawiki#Backwards_Compatibility">BIP 16</a>.
</p>

<p>
Note that providing and using those inputs is necessary to achieve
security. Imagine a script the pushes a magic number on the stack,
duplicates it, and checks for equality. This script doesn't use inputs
and always succeeds. If you use the hash of this script to receive
funds, then as soon as you broadcast a transaction that spends your
coins, anyone watching could use your script to broadcast a different
transaction spending the output in a different way.
</p>

<p>
It is cheaper to use P2SH to implement multisig than it is to use the
P2MS pattern.
</p>
</div>
</div>

<div id="outline-container-orge0b5efa" class="outline-3">
<h3 id="orge0b5efa">Data Output</h3>
<div class="outline-text-3" id="text-orge0b5efa">
<p>
Overview: the locking script just stores data.
</p>

<p>
Example transaction:
<a href="https://blockchair.com/bitcoin/transaction/52dd20f60d6e14e5a783e7668cf410efdea40cd9a92479b0f2423d0bc63575fa"><kbd>52dd20f60d6e14e5a783e7668cf410efdea40cd9a92479b0f2423d0bc63575fa</kbd></a>
</p>
</div>
</div>
</div>

<div id="outline-container-org5327449" class="outline-2">
<h2 id="org5327449">"Segregated Witness"</h2>
<div class="outline-text-2" id="text-org5327449">
<p>
"Segregated witness" or "segwit" refers to the segregation of witness
data (the <kbd>scriptSig</kbd> of each transaction input) from the transaction
itself. In 2015, <a href="https://github.com/bitcoin/bips/blob/master/bip-0141.mediawiki">BIP141</a> proposed this change and <a href="https://github.com/bitcoin/bips/blob/master/bip-0173.mediawiki">BIP173</a> proposed a new
address type for native segregates witness output. People refer to
P2PKH and P2SH segwit transactions as P2WPKH and P2WSH repectively,
but the logic of the locking is the same<sup><a id="fnr.19" class="footref" href="#fn.19" role="doc-backlink">19</a></sup>
</p>
<ul class="org-ul">
<li><a href="https://learnmeabitcoin.com/faq/segregated-witness">https://learnmeabitcoin.com/faq/segregated-witness</a></li>
<li><a href="https://bitcoin.stackexchange.com/questions/75047/bitcoin-technical-difference-between-p2pkh-and-p2sh-address-generation">https://bitcoin.stackexchange.com/questions/75047/bitcoin-technical-difference-between-p2pkh-and-p2sh-address-generation</a></li>
</ul>
</div>
</div>
