bitcoin-transactions.org
* Using bitcoin: "addresses" and "wallets"
A wallet is a piece of hardware or software that interfaces with the
ledger (blockchain) and stores the keys that allow you (and only you)
to spend transaction output. "Wallet" is a misleading metaphor if:
- It evokes the existence of distinct tokens
- It can be understood as a single address on the blockchain that
  accumulates a balance over time

In fact, "addresses" aren't intended to be reused[fn:20], and
"addresses" (transaction outputs) don't have balances: they're either
spent or unspent. That being said, a wallet can be thought of as an
account, composed of many different addresses, that together have a
usable balance.

In order to make a bitcoin address, you don't actually need to access
the blockchain or the internet: you just need to understand how
locking scripts work. There are various tools that automate the
process of address generation without functioning as a complete
"wallet":
- [[https://www.bitaddress.org][www.bitaddress.org]] 
- [[https://github.com/samr7/vanitygen][vanitygen]], a command-line tool for generating vanity bitcoin
  addresses

And there are also many walkthroughs on manually generating a bitcoin
address yourself:
- https://bitcoin.stackexchange.com/questions/59644/how-do-these-openssl-commands-create-a-bitcoin-private-key-from-a-ecdsa-keypair
- https://bitcoin.stackexchange.com/questions/10827/generate-address-for-receiving-on-gnu-linux-without-bitcoin-client
- https://www.freecodecamp.org/news/how-to-generate-your-very-own-bitcoin-private-key-7ad0f4936e6c/
- https://bitcoinmagazine.com/culture/diy-bitcoin-private-key-project
- https://bitcoin.stackexchange.com/questions/7491/how-to-generate-keypair-completely-offline
- https://medium.com/coinmonks/how-to-generate-a-bitcoin-address-step-by-step-9d7fcbf1ad0b
- https://gist.github.com/colindean/5239812

Then there are of course many wallets, and many classifications of
wallets: hot, cold, paper, custodial, non-custodial, hardware,
software, ...

https://en.bitcoin.it/wiki/Wallet

There are estimated to be 460 million bitcoin addresses as of
2018[fn:21].

How you choose to generate bitcoin address is up to you, but security
is important. If you choose a non-random private key, such as ~0x1~,
then the corresponding address will be publicly known. For private key
~0x1~, the corresponding address is
[[https://www.blockchain.com/btc/address/1EHNa6Q4Jz2uvNExL497mE43ikXhwF6kZm][~1EHNa6Q4Jz2uvNExL497mE43ikXhwF6kZm~]]: you can see that any funds to this
account are quickly spent[fn:22].

A secure, somewhat accessible way (outlined [[https://en.bitcoin.it/wiki/How_to_set_up_a_secure_offline_savings_wallet][here]]) to generate an
address/secret pair is do so on a bootable, verified linux USB drive
that you never connect to the internet. Specifically, I recommend
making a bootable copy of tails (something good to have around
anyways), which comes with the Electrum wallet by default. [[https://dev-notes.eu/2017/08/setup-and-manage-bitcoin-core-cold-storage-wallet/][This post]]
offers a good walkthrough of the process (tails itself has good
documentation on installing and verifying tails), but it uses verified
bitcoin-core binaries instead of tails' builtin Electrum app. The way
I recommend is to:
  1. [[https://tails.boum.org/install/index.en.html][Install tails]] on a USB
  2. Disable internet connection and boot tails
  3. Use Electrum to generate a new wallet
  4. Store your public/private key pair (however you want)

Once you make an address, how should you store the key? Well, this
question can be asked of any digital secret--I don't think there
should be a special answer for bitcoin. [[https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki][BIP39]] standardized a mnemonic
code so that a private key can be stored as a sequence of words (in
English or other languages) instead of as a number (encoded in
decimal, binary, hex, base58, etc). This sequence of words is called a
seed and can be used to deterministically generate a tree of keypairs
(many addresses) according to [[https://github.com/bitcoin/bips/blob/master/bip-0032.mediawiki][BIP32]]. A BIP39 seed has at least 128
bits of entropy (Electrum's has 132 bits of entropy [fn:23]) so that
it has enough entropy to generate a private key of 128 bits of
entropy. This seed can be easily written down and stored on paper.

* Nodes, the network, blockchain, etc.
I'm leaving these concepts out of scope for now. There are lots of
interesting topics beyond transactions such as:
- "Forking" the blockchain
- Proof-of-work
- Attacks
- "Mining"

For architectural considerations of bitcoin, I would recommend the
whitepaper: https://bitcoin.org/bitcoin.pdf

Also, try this walkthrough of bitcoin mining using pen and paper:
https://www.righto.com/2014/09/mining-bitcoin-with-pencil-and-paper.html

** Preventing Double-Spend
Bitcoin nodes maintain an [[https://stackoverflow.com/questions/30425272/how-do-bitcoin-miners-check-for-double-spend-or-over-spend][index of UTXOs]] (unspent transaction outputs)
alongside the blockchain. I haven't looked at the implementation, but
I imagine this to be a hash table mapping a transaction id ~+~ output
index to a locking script [fn:24]. Generating this index from an
existing blockchain would be straightforward. The chain would be
processes block-by-block, transaction-by-transaction: each valid
transaction output would be unconditionally added to the index (in
amortized O(1) time); each input would be checked against the index
(also O(1) time) and then removed (constant-time) if present
(otherwise the transaction would be rejected, or the block
unconfirmed).

* Resources
- Wiki: https://en.bitcoin.it/wiki/Main_Page
- https://learnmeabitcoin.com/technical/
- Original source code: https://satoshi.nakamotoinstitute.org/code/
- Original bitcoin announcement: https://satoshi.nakamotoinstitute.org/emails/cryptography/16/

