bitcoin-transactions.html

<div id="outline-container-org022dbf3" class="outline-2">
<h2 id="org022dbf3">Using bitcoin: "addresses" and "wallets"</h2>
<div class="outline-text-2" id="text-org022dbf3">
<p>
A wallet is a piece of hardware or software that interfaces with the
ledger (blockchain) and stores the keys that allow you (and only you)
to spend transaction output. "Wallet" is a misleading metaphor if:
</p>
<ul class="org-ul">
<li>It evokes the existence of distinct tokens</li>
<li>It can be understood as a single address on the blockchain that
accumulates a balance over time</li>
</ul>

<p>
In fact, "addresses" aren't intended to be reused<sup><a id="fnr.20" class="footref" href="#fn.20" role="doc-backlink">20</a></sup>, and
"addresses" (transaction outputs) don't have balances: they're either
spent or unspent. That being said, a wallet can be thought of as an
account, composed of many different addresses, that together have a
usable balance.
</p>

<p>
In order to make a bitcoin address, you don't actually need to access
the blockchain or the internet: you just need to understand how
locking scripts work. There are various tools that automate the
process of address generation without functioning as a complete
"wallet":
</p>
<ul class="org-ul">
<li><a href="https://www.bitaddress.org">www.bitaddress.org</a></li>
<li><a href="https://github.com/samr7/vanitygen">vanitygen</a>, a command-line tool for generating vanity bitcoin
addresses</li>
</ul>

<p>
And there are also many walkthroughs on manually generating a bitcoin
address yourself:
</p>
<ul class="org-ul">
<li><a href="https://bitcoin.stackexchange.com/questions/59644/how-do-these-openssl-commands-create-a-bitcoin-private-key-from-a-ecdsa-keypair">https://bitcoin.stackexchange.com/questions/59644/how-do-these-openssl-commands-create-a-bitcoin-private-key-from-a-ecdsa-keypair</a></li>
<li><a href="https://bitcoin.stackexchange.com/questions/10827/generate-address-for-receiving-on-gnu-linux-without-bitcoin-client">https://bitcoin.stackexchange.com/questions/10827/generate-address-for-receiving-on-gnu-linux-without-bitcoin-client</a></li>
<li><a href="https://www.freecodecamp.org/news/how-to-generate-your-very-own-bitcoin-private-key-7ad0f4936e6c/">https://www.freecodecamp.org/news/how-to-generate-your-very-own-bitcoin-private-key-7ad0f4936e6c/</a></li>
<li><a href="https://bitcoinmagazine.com/culture/diy-bitcoin-private-key-project">https://bitcoinmagazine.com/culture/diy-bitcoin-private-key-project</a></li>
<li><a href="https://bitcoin.stackexchange.com/questions/7491/how-to-generate-keypair-completely-offline">https://bitcoin.stackexchange.com/questions/7491/how-to-generate-keypair-completely-offline</a></li>
<li><a href="https://medium.com/coinmonks/how-to-generate-a-bitcoin-address-step-by-step-9d7fcbf1ad0b">https://medium.com/coinmonks/how-to-generate-a-bitcoin-address-step-by-step-9d7fcbf1ad0b</a></li>
<li><a href="https://gist.github.com/colindean/5239812">https://gist.github.com/colindean/5239812</a></li>
</ul>

<p>
Then there are of course many wallets, and many classifications of
wallets: hot, cold, paper, custodial, non-custodial, hardware,
software, &#x2026;
</p>

<p>
<a href="https://en.bitcoin.it/wiki/Wallet">https://en.bitcoin.it/wiki/Wallet</a>
</p>

<p>
There are estimated to be 460 million bitcoin addresses as of
2018<sup><a id="fnr.21" class="footref" href="#fn.21" role="doc-backlink">21</a></sup>.
</p>

<p>
How you choose to generate bitcoin address is up to you, but security
is important. If you choose a non-random private key, such as <kbd>0x1</kbd>,
then the corresponding address will be publicly known. For private key
<kbd>0x1</kbd>, the corresponding address is
<a href="https://www.blockchain.com/btc/address/1EHNa6Q4Jz2uvNExL497mE43ikXhwF6kZm"><kbd>1EHNa6Q4Jz2uvNExL497mE43ikXhwF6kZm</kbd></a>: you can see that any funds to this
account are quickly spent<sup><a id="fnr.22" class="footref" href="#fn.22" role="doc-backlink">22</a></sup>.
</p>

<p>
A secure, somewhat accessible way (outlined <a href="https://en.bitcoin.it/wiki/How_to_set_up_a_secure_offline_savings_wallet">here</a>) to generate an
address/secret pair is do so on a bootable, verified linux USB drive
that you never connect to the internet. Specifically, I recommend
making a bootable copy of tails (something good to have around
anyways), which comes with the Electrum wallet by default. <a href="https://dev-notes.eu/2017/08/setup-and-manage-bitcoin-core-cold-storage-wallet/">This post</a>
offers a good walkthrough of the process (tails itself has good
documentation on installing and verifying tails), but it uses verified
bitcoin-core binaries instead of tails' builtin Electrum app. The way
I recommend is to:
</p>
<ol class="org-ol">
<li><a href="https://tails.boum.org/install/index.en.html">Install tails</a> on a USB</li>
<li>Disable internet connection and boot tails</li>
<li>Use Electrum to generate a new wallet</li>
<li>Store your public/private key pair (however you want)</li>
</ol>

<p>
Once you make an address, how should you store the key? Well, this
question can be asked of any digital secret&#x2013;I don't think there
should be a special answer for bitcoin. <a href="https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki">BIP39</a> standardized a mnemonic
code so that a private key can be stored as a sequence of words (in
English or other languages) instead of as a number (encoded in
decimal, binary, hex, base58, etc). This sequence of words is called a
seed and can be used to deterministically generate a tree of keypairs
(many addresses) according to <a href="https://github.com/bitcoin/bips/blob/master/bip-0032.mediawiki">BIP32</a>. A BIP39 seed has at least 128
bits of entropy (Electrum's has 132 bits of entropy <sup><a id="fnr.23" class="footref" href="#fn.23" role="doc-backlink">23</a></sup>) so that
it has enough entropy to generate a private key of 128 bits of
entropy. This seed can be easily written down and stored on paper.
</p>
</div>
</div>

<div id="outline-container-org1a3054e" class="outline-2">
<h2 id="org1a3054e">Nodes, the network, blockchain, etc.</h2>
<div class="outline-text-2" id="text-org1a3054e">
<p>
I'm leaving these concepts out of scope for now. There are lots of
interesting topics beyond transactions such as:
</p>
<ul class="org-ul">
<li>"Forking" the blockchain</li>
<li>Proof-of-work</li>
<li>Attacks</li>
<li>"Mining"</li>
</ul>

<p>
For architectural considerations of bitcoin, I would recommend the
whitepaper: <a href="https://bitcoin.org/bitcoin.pdf">https://bitcoin.org/bitcoin.pdf</a>
</p>

<p>
Also, try this walkthrough of bitcoin mining using pen and paper:
<a href="https://www.righto.com/2014/09/mining-bitcoin-with-pencil-and-paper.html">https://www.righto.com/2014/09/mining-bitcoin-with-pencil-and-paper.html</a>
</p>
</div>

<div id="outline-container-orgdb1f4af" class="outline-3">
<h3 id="orgdb1f4af">Preventing Double-Spend</h3>
<div class="outline-text-3" id="text-orgdb1f4af">
<p>
Bitcoin nodes maintain an <a href="https://stackoverflow.com/questions/30425272/how-do-bitcoin-miners-check-for-double-spend-or-over-spend">index of UTXOs</a> (unspent transaction outputs)
alongside the blockchain. I haven't looked at the implementation, but
I imagine this to be a hash table mapping a transaction id <kbd>+</kbd> output
index to a locking script <sup><a id="fnr.24" class="footref" href="#fn.24" role="doc-backlink">24</a></sup>. Generating this index from an
existing blockchain would be straightforward. The chain would be
processes block-by-block, transaction-by-transaction: each valid
transaction output would be unconditionally added to the index (in
amortized O(1) time); each input would be checked against the index
(also O(1) time) and then removed (constant-time) if present
(otherwise the transaction would be rejected, or the block
unconfirmed).
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc12c6d" class="outline-2">
<h2 id="orgdc12c6d">Resources</h2>
<div class="outline-text-2" id="text-orgdc12c6d">
<ul class="org-ul">
<li>Wiki: <a href="https://en.bitcoin.it/wiki/Main_Page">https://en.bitcoin.it/wiki/Main_Page</a></li>
<li><a href="https://learnmeabitcoin.com/technical/">https://learnmeabitcoin.com/technical/</a></li>
<li>Original source code: <a href="https://satoshi.nakamotoinstitute.org/code/">https://satoshi.nakamotoinstitute.org/code/</a></li>
<li>Original bitcoin announcement: <a href="https://satoshi.nakamotoinstitute.org/emails/cryptography/16/">https://satoshi.nakamotoinstitute.org/emails/cryptography/16/</a></li>
</ul>
</div>
</div>
