bitcoin-transactions.org
* Footnotes

[fn:1] https://en.bitcoin.it/wiki/Block

[fn:2] https://en.bitcoin.it/wiki/Transaction

[fn:3] Refer to the original source code: https://s3.amazonaws.com/nakamotoinstitute/code/bitcoin-0.1.0.tgz

[fn:4] https://learnmeabitcoin.com/technical/script

[fn:5] https://bitcoin.stackexchange.com/questions/93013/are-all-three-bitcoin-address-types-interoperable-legacy-segwit-native-segwit

[fn:6] Here is a script that can be redeemed by anyone who can
demonstrate a hash collision:
https://bitcointalk.org/index.php?topic=293382.0

[fn:7] https://www.oreilly.com/library/view/mastering-bitcoin/9781491902639/ch05.html

[fn:8] https://medium.com/coinmonks/how-to-generate-a-bitcoin-address-step-by-step-9d7fcbf1ad0b

[fn:9] The most significant zero bit in the binary representation of the
maximal private key is bit 125. $2^{125}$ is around $10^{37}$; there are
about $10^{21}$ grains of sand on Earth ([[https://en.wikipedia.org/wiki/Orders_of_magnitude_(numbers)#1021][source]]), and so there are 10^{38}
grains of sand on ten quadrillion ($10^{16}$) Earths.

[fn:10] https://en.bitcoin.it/wiki/Invoice_address

[fn:11] https://en.bitcoin.it/wiki/List_of_address_prefixes

[fn:12] /citation needed/

[fn:13] https://bitcoin.stackexchange.com/questions/2013/why-does-the-length-of-a-bitcoin-key-vary

[fn:14] https://en.bitcoinwiki.org/wiki/Pay-to-Pubkey_Hash

[fn:15] https://bitcoin.stackexchange.com/questions/72184/why-is-p2pkh-used-instead-of-the-simpler-p2pk

[fn:16] https://stackoverflow.com/questions/2658601/do-cryptographic-hash-functions-reach-each-possible-values-i-e-are-they-surje

[fn:17] https://learnmeabitcoin.com/technical/p2pkh

[fn:18] https://bitcoin.stackexchange.com/questions/3600/why-are-bitcoin-addresses-hashes-of-public-keys

[fn:19] https://programmingblockchain.gitbook.io/programmingblockchain/other_types_of_ownership/p2wpkh_pay_to_witness_public_key_hash

[fn:20] https://en.bitcoin.it/wiki/Address_reuse

[fn:21] https://blog.chainalysis.com/reports/bitcoin-addresses/

[fn:22] https://towardsdatascience.com/a-shallow-dive-into-bitcoins-blockchain-part-2-transactions-d4ee83067bae

[fn:23] https://electrum.readthedocs.io/en/latest/faq.html
https://crypto.stackexchange.com/questions/26791/how-many-bits-of-entropy-does-an-elliptic-curve-key-of-length-n-provide

[fn:24] https://learnmeabitcoin.com/technical/p2sh
